{
  "questions": [
    {
      "question": "Two gamblers are playing a coin toss game. Gambler A has n+{{random_int(min_val=1, max_val=100)}} fair coins. Gambler B has n fair coins. Both gamblers flip all of their coins. What is the probability that A will have more heads than B?",
      "solution-template": "We proceed using symmetry and basic reasoning. The extra coin gives A an advantage. To analyze this, remove one coin from A so that both gamblers now flip exactly n coins. This makes the situation symmetric between A and B. Let us compare the number of heads obtained from these n coins. There are three possible events:\n\nE_1: A's n coins have more heads than B's n coins,\nE_2: A's n coins have the same number of heads as B's n coins,\nE_3: A's n coins have fewer heads than B's n coins.\n\nBy symmetry, the probability that A has more heads than B is the same as the probability that B has more heads than A, so P(E_1) = P(E_3). Let P(E_1) = P(E_3) = x, and P(E_2) = y. Since these events exhaust all possibilities, we have 2x + y = 1.\n\nNow consider A's additional (n+1)-st coin. In event E_1, A already has more heads than B, regardless of how the extra coin lands. In event E_3, A cannot have more heads than B, regardless of the extra coin. In event E_2, the extra coin does matter: if it lands heads (with probability 0.5), A will have more heads than B; if it lands tails, the totals remain tied.\n\nTherefore, the extra coin increases the probability that A has more heads by 0.5y. The total probability that A has more heads than B is x + 0.5y. Using y = 1 - 2x, we obtain x + 0.5(1 - 2x) = 0.5.\n\nSo, when A has n+1 fair coins and B has n fair coins, the probability that A ends up with more heads than B is exactly one half.",
      "difficulty": "easy",
      "usage-count": 0
    },
    {
      "question": "A casino offers a simple card game. There are {{random_int(min_val=36, max_val=52)}} cards in a deck with {{random_int(min_val=2, max_val=4)}} cards for each value. Each time the cards are thoroughly shuffled (so each card has equal probability of being selected). You pick up a card from the deck and the dealer picks another one without replacement. If you have a larger number, you win; if the numbers are equal or yours is smaller, the house wins—as in all other casinos, the house always has better odds of winning. What is your probability of winning?\nHint: What are the possible results (events) if we compare the number of heads in A's first n coins with B's in coins? By making the number of coins equal, we can take advantage of symmetry. For each event, what will happen if A's last coin is a head? Or a tail?",
      "solution-template": "One answer to this problem is to consider all 13 different outcomes of your card. The card can have a value 2, 3, ..., A and each has 1/13 of probability. With a value of 2, the probability of winning is 0/51; with a value of 3, the probability of winning is 4/51 (when the dealer picks a 2); ...; with a value of A, the probability of winning is 48/51 (when the dealer picks a 2, 3, ..., or K). So your probability of winning is\n\n(1/13) x (0/51 + 4/51 + ··· + 48/51)\n= (4 / (13 x 51)) x (0 + 1 + ··· + 12)\n= (4 / (13 x 51)) x (12 x 13 / 2)\n= 8/17.\n\nAlthough, this is a straightforward solution and it elegantly uses the sum of an integer sequence, it is not the most efficient way to solve the problem. If you have got the core spirits of the coin tossing problem, you may approach the problem by considering three different outcomes:\n\nE₁: Your card has a number larger than the dealer's;\nE₂: Your card has a number equal to the dealer's;\nE₃: Your card has a number lower than the dealer's.\n\nAgain by symmetry, P(E₁) = P(E₃). So we only need to figure out P(E₂), the probability that two cards have equal value. Let's say you have randomly selected a card. Among the remaining 51 cards, only 3 cards will have the same value as your card. So the probability that the two cards have equal value is 3/51. As a result, the probability that you win is\n\nP(E₁) = (1 - P(E₂)) / 2 = (1 - 3/51) / 2 = 8/17.",
      "difficulty": "easy",
      "usage-count": 0
    }
  ]
}
